validacao/results/dvwa/coraza/06_wrk.log
=== wrk | dvwa/coraza | https://172.18.0.6:443 | 17/07/2026 20:50:02,08 ===
REPETICOES: 1
CMD: wrk -t12 -c400 -d30s --timeout 5s --latency -H "User-Agent: DoBotShield-TCC-Validation/1.0" https://172.18.0.6:443
----------------------------------------------------------------

=== EXECUCAO UNICA ===
Running 30s test @ https://172.18.0.6:443
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   399.80ms  914.78ms   5.00s    88.90%
    Req/Sec   183.45     96.47     0.97k    79.26%
  Latency Distribution
     50%   58.58ms
     75%  153.91ms
     90%    1.57s 
     99%    4.17s 
  61309 requests in 30.05s, 27.54MB read
  Socket errors: connect 0, read 0, write 0, timeout 733
Requests/sec:   2039.97
Transfer/sec:      0.92MB
RUN_RC=0

TOOL_RC=0