validacao/results/dvwa/coraza/06_wrk.log
=== wrk | dvwa/coraza | https://172.23.0.7:443 | 15/07/2026  8:32:08,72 ===
REPETICOES: 3
CMD: wrk -t12 -c400 -d30s --timeout 5s --latency -H "User-Agent: DoBotShield-TCC-Validation/1.0" https://172.23.0.7:443
----------------------------------------------------------------

=== REPETICAO 1/3 ===
Running 30s test @ https://172.23.0.7:443
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   444.53ms  741.52ms   4.97s    87.24%
    Req/Sec   199.47    134.86     0.97k    70.63%
  Latency Distribution
     50%   91.21ms
     75%  532.07ms
     90%    1.43s 
     99%    3.42s 
  67014 requests in 30.10s, 30.10MB read
  Socket errors: connect 0, read 0, write 0, timeout 225
Requests/sec:   2226.42
Transfer/sec:      1.00MB
RUN_RC_1=0

=== REPETICAO 2/3 ===
Running 30s test @ https://172.23.0.7:443
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   496.24ms  760.00ms   4.41s    85.82%
    Req/Sec   160.45     80.89   640.00     75.23%
  Latency Distribution
     50%  156.50ms
     75%  601.26ms
     90%    1.64s 
     99%    3.30s 
  57247 requests in 30.10s, 25.71MB read
Requests/sec:   1902.09
Transfer/sec:      0.85MB
RUN_RC_2=0

=== REPETICAO 3/3 ===
Running 30s test @ https://172.23.0.7:443
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   499.44ms  770.69ms   4.16s    85.68%
    Req/Sec   181.94     69.46   484.00     67.80%
  Latency Distribution
     50%  142.53ms
     75%  622.62ms
     90%    1.64s 
     99%    3.38s 
  64826 requests in 30.08s, 29.12MB read
  Socket errors: connect 0, read 0, write 0, timeout 2
Requests/sec:   2155.37
Transfer/sec:      0.97MB
RUN_RC_3=0

TOOL_RC=0