validacao/results/dvwa/coraza/06_wrk.log
=== wrk | dvwa/coraza | https://172.18.0.6:443 | 17/07/2026 20:50:02,08 ===
REPETICOES: 3
CMD: wrk -t12 -c400 -d30s --timeout 5s --latency -H "User-Agent: DoBotShield-TCC-Validation/1.0" https://172.18.0.6:443
----------------------------------------------------------------

=== REPETICAO 1/3 ===
Running 30s test @ https://172.18.0.6:443
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   399.80ms  914.78ms   5.00s    88.90%
    Req/Sec   183.45     96.47     0.97k    79.26%
  Latency Distribution
     50%   58.58ms
     75%  153.91ms
     90%    1.57s 
     99%    4.17s 
  61309 requests in 30.05s, 27.54MB read
  Socket errors: connect 0, read 0, write 0, timeout 733
Requests/sec:   2039.97
Transfer/sec:      0.92MB
RUN_RC_1=0

=== REPETICAO 2/3 ===
Running 30s test @ https://172.18.0.6:443
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   306.22ms  731.98ms   4.99s    91.54%
    Req/Sec   159.08     65.93   464.00     68.17%
  Latency Distribution
     50%  103.57ms
     75%  164.72ms
     90%  712.64ms
     99%    3.88s 
  56285 requests in 30.11s, 25.28MB read
  Socket errors: connect 0, read 0, write 0, timeout 654
Requests/sec:   1869.29
Transfer/sec:    859.80KB
RUN_RC_2=0

=== REPETICAO 3/3 ===
Running 30s test @ https://172.18.0.6:443
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   360.34ms  793.46ms   4.96s    88.99%
    Req/Sec   177.42     68.95   530.00     69.23%
  Latency Distribution
     50%   98.27ms
     75%  159.58ms
     90%    1.36s 
     99%    3.78s 
  62858 requests in 30.08s, 28.23MB read
  Socket errors: connect 0, read 0, write 0, timeout 699
Requests/sec:   2089.38
Transfer/sec:      0.94MB
RUN_RC_3=0

TOOL_RC=0